// Завдання 1
// В HTML є список категорій ul#categories.
// - Тварини
// - Продукти
// - Технології
// Напиши скрипт, який виконає наступні операції.
// Порахує і виведе в консоль кількість категорій в ul#categories, тобто елементів li.item. Вийде 'У списку 3 категорії.'.
// Для кожного елемента li.item в списку ul#categories, знайде і виведе в консоль текст заголовка елемента (тега h2) і кількість елементів в категорії (всіх вкладених в нього елементів li).
// Наприклад, для першої категорії вийде:
// Категорія: Тварини
// Кількість елементів: 4



// Завдання 2
// В HTML є пустий список ul#ingredients.
// В JS є масив рядків.
// Напиши скрипт, який для кожного елемента масиву ingredients створить окремий li, після чого вставить всі li за одну операцію в список ul.ingredients. Для створення DOM-вузлів використовуй document.createElement().




// Завдання 3
// Напиши скрипт для створення галереї зображень по масиву даних.
// В HTML є список ul#gallery.
// Використовуй масив об'єктів images для створення тегів img вкладених в li. Для створення розмітки використовуй шаблонні рядки і insertAdjacentHTML().
// Всі елементи галереї повинні додаватися в DOM за одну операцію вставки.
// Додай мінімальне оформлення галереї флексбоксами або грід через css-класи.




//   Завдання 4
//   Лічильник складається зі спана і кнопок, які повинні збільшувати і зменшувати значення лічильника на 1.
//   Створи змінну counterValue в якій буде зберігається поточне значення лічильника.
//   Створи функції increment і decrement для збільшення і зменшення значення лічильника.
//   Додай слухачі кліків на кнопки, виклики функцій та оновлення інтерфейсу
  